{
  "backend/main.mo": "Main backend actor that includes storage and authorization mixins, implements profanity filtering for user-generated content (bio, descriptions), and manages reel/profile CRUD operations with content validation.",
  "backend/migration.mo": "Migration module that currently performs no state transformations, simply returning the existing state unchanged.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features for displaying user-friendly validation error messages in ProfileSetupModal, ProfileEditForm, and ReelUploadForm components when profanity is detected.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their roles in the Instagram-like social media app with validation error handling.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes using warm earth tones.",
  "frontend/index.html": "HTML entry point for the Social Reel application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component that sets up TanStack Router, handles authentication flow, and conditionally displays ProfileSetupModal for new users.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header navigation (Feed, Reels links), upload dialog, profile/logout buttons, and footer with attribution.",
  "frontend/src/components/ProfileEditForm.tsx": "Profile editing form with username, bio, and profile picture fields that displays validation errors from backend profanity checks and prevents submission until corrected.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal component for initial user profile setup with username, bio, and profile picture upload. Includes validation error handling for inappropriate content and upload progress tracking.",
  "frontend/src/components/ReelCard.tsx": "Full-screen vertical video card component for displaying reels with autoplay, mute toggle, uploader profile info, and description overlay. Designed for TikTok-style scrolling feed.",
  "frontend/src/components/ReelUploadForm.tsx": "Form component for uploading video reels with description field, file validation, upload progress tracking, and profanity/validation error handling.",
  "frontend/src/components/VideoCard.tsx": "Grid-style video card component with thumbnail, play/pause controls, mute toggle, and uploader profile display. Used for browse/gallery views rather than full-screen scrolling.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance with authentication, handling identity changes and admin token initialization while invalidating dependent queries on actor updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles and reels, including getting caller/user profiles, saving profiles, uploading reels, and fetching all reels or reels by uploader.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components (primary, secondary, muted, accent, destructive, sidebar, etc.) using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component into the DOM.",
  "frontend/src/pages/LoginPage.tsx": "Login page component displaying the app logo, welcome message, and an Internet Identity login button with loading state.",
  "frontend/src/pages/ProfilePage.tsx": "Profile page displaying user information, avatar, bio, and their uploaded reels with edit functionality for the logged-in user's own profile.",
  "frontend/src/pages/ReelsFeedPage.tsx": "Full-screen vertical scrolling feed for reels with snap-to-viewport behavior, tracking active reel index and showing loading/empty states.",
  "frontend/src/pages/VideoFeedPage.tsx": "Grid-based video feed page displaying all reels in a responsive card layout with loading and empty state handling.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors using OKLCH, container settings, border radius variables, animations, and typography/container-queries plugins.",
  "project_state.json": "Project state file tracking a social media app similar to Instagram with user authentication, reels, video content, and content moderation features. Contains existing implemented features (user registration, profiles, reels, video feed, UI design, error messaging) and pending feature requests (video upload system, content moderation)."
}