{
  "backend/main.mo": "Main actor implementing a social media platform with user profiles, video reels, follow/unfollow functionality, profanity filtering, and role-based access control using mixins for storage and authorization.",
  "backend/migration.mo": "Migration module that transforms old actor state to new schema by adding empty follower and following maps while preserving existing user profiles and reels data.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including members page, follow/unfollow buttons, follower/following lists, and personalized feed with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to their descriptions, covering components, pages, hooks, and configuration files for the social media application.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark modes using warm earth tones for a photography-focused aesthetic.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component with TanStack Router setup defining routes for video feed, reels, members, profiles, followers, and following pages, with authentication checks and profile setup modal.",
  "frontend/src/components/FollowButton.tsx": "Interactive button component that toggles between follow and unfollow states with loading indicators, toast notifications, and automatic hiding on own profile.",
  "frontend/src/components/Layout.tsx": "Main layout component with header navigation, logo, and action buttons (Upload, Profile, Logout). Includes a dialog for uploading reels and handles user authentication state.",
  "frontend/src/components/MemberCard.tsx": "Displays a member card with avatar, username, follower count, and bio. Links to the user's profile page.",
  "frontend/src/components/ProfileEditForm.tsx": "Form for editing user profile including username, bio, and profile picture with upload progress tracking. Handles validation errors and displays success/error toasts.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for initial profile setup requiring username, optional bio, and profile picture. Non-dismissible modal that validates input and handles profanity checking.",
  "frontend/src/components/ReelCard.tsx": "Video player card component for displaying reels with autoplay, mute toggle, uploader info, and description overlay. Manages video playback based on active state.",
  "frontend/src/components/ReelUploadForm.tsx": "Form for uploading video reels with description field, file selection, and upload progress tracking. Validates video files and handles profanity checking on descriptions.",
  "frontend/src/components/VideoCard.tsx": "React component that displays a video reel card with play/pause and mute controls, showing the uploader's avatar, username, and description with hover interactions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance with authentication, creating actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality using DFINITY's AuthClient with delegation identity management.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, reels, follows, and feed data through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes using HSL values for UI components.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/FollowersPage.tsx": "Page component that displays a grid of follower cards for a user profile, fetching follower principals and their associated profiles with loading and empty states.",
  "frontend/src/pages/FollowingPage.tsx": "Displays a list of users that a specific profile is following, fetching their profiles and follower counts. Includes navigation back to the profile and empty state handling.",
  "frontend/src/pages/LoginPage.tsx": "Landing page with Internet Identity authentication button and branding. Shows loading state during login process.",
  "frontend/src/pages/MembersPage.tsx": "Displays all community members by fetching unique uploaders from reels, showing their profiles and follower counts in a grid layout. Includes loading skeletons and empty state.",
  "frontend/src/pages/ProfilePage.tsx": "User profile page showing avatar, bio, follower/following counts, and uploaded reels. Supports profile editing for own profile and follow button for others.",
  "frontend/src/pages/ReelsFeedPage.tsx": "Full-screen vertical scrolling feed of reels with snap-to-viewport behavior. Tracks active reel index based on scroll position.",
  "frontend/src/pages/VideoFeedPage.tsx": "Grid-based video feed page displaying all reels in a responsive layout. Shows empty state when no videos exist.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both query strings and hash-based routing, with sessionStorage support for parameter persistence across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom color schemes using OKLCH color space, extends theme with custom spacing, fonts, animations, and includes plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file for a social media app called 'Social Reel' that tracks implemented features (members page, follow/unfollow, follower lists, filtered reels feed) and pending feature requests (social reels, profiles, Facebook/Telegram-inspired features)."
}